## Import Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## Import Data

In [3]:
#path to main folder
path = r'C:\Users\steve\Documents\Olist Marketplace Analysis'

# import order payments file
pay_df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'olist_order_payments_dataset.csv'), index_col = False)

## Analysis

#### 01. Content + Shape

In [8]:
pay_df.head()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
0,b81ef226f3fe1789b1e8b2acac839d17,1,credit_card,8,99.33
1,a9810da82917af2d9aefd1278f1dcfa0,1,credit_card,1,24.39
2,25e8ea4e93396b6fa0d3dd708e76c1bd,1,credit_card,1,65.71
3,ba78997921bbcdc1373bb41e913ab953,1,credit_card,8,107.78
4,42fdf880ba16b47b59251dd489d4441a,1,credit_card,2,128.45

In [12]:
pay_df['payment_value'].max()

13664.08

In [8]:
pay_df.tail()

,order_id,payment_sequential,payment_type,payment_installments,payment_value
103881,0406037ad97740d563a178ecc7a2075c,1,boleto,1,363.31
103882,7b905861d7c825891d6347454ea7863f,1,credit_card,2,96.80
103883,32609bbb3dd69b3c066a6860554a77bf,1,credit_card,1,47.77
103884,b8b61059626efa996a60be9bb9320e10,1,credit_card,5,369.54
103885,28bbae6599b09d39ca406b747b6632b1,1,boleto,1,191.58

In [10]:
pay_df.shape

(103886, 5)

In [12]:
pay_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103886 entries, 0 to 103885
Data columns (total 5 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   order_id              103886 non-null  object
 1   payment_sequential    103886 non-null  int64
 2   payment_type          103886 non-null  object
 3   payment_installments  103886 non-null  int64
 4   payment_value         103886 non-null  float64
dtypes: float64(1), int64(2), object(2)
memory usage: 4.0+ MB

In [14]:
pay_df.describe()

       payment_sequential  payment_installments  payment_value
count       103886.000000         103886.000000  103886.000000
mean             1.092679              2.853349     154.100380
std              0.706584              2.687051     217.494064
min              1.000000              0.000000       0.000000
25%              1.000000              1.000000      56.790000
50%              1.000000              1.000000     100.000000
75%              1.000000              4.000000     171.837500
max             29.000000             24.000000   13664.080000

#### 02. Value Counts

Order id

In [18]:
# get counts of order ids
pay_df['order_id'].value_counts(dropna = False)

order_id
fa65dad1b0e818e3ccc5cb0e39231352    29
ccf804e764ed5650cd8759557269dc13    26
285c2e15bebd4ac83635ccc563dc71f4    22
895ab968e7bb0d5659d16cd74cd1650c    21
fedcd9f7ccdc8cba3a18defedd1a5547    19
                                    ..
6d2a30c9b7dcee3ed507dc9a601f99e7     1
a7737f6d9208dd56ea498a322ed3c37f     1
646e62df54f3e236eb6d5ff3b31429b8     1
e115da7a49ec2acf622e1f31da65cfb9     1
28bbae6599b09d39ca406b747b6632b1     1
Name: count, Length: 99440, dtype: int64

**Unique Order IDs** = 99,440

Payment Sequential

In [21]:
# get counts of payment sequentials
pay_df['payment_sequential'].value_counts(dropna = False)

payment_sequential
1     99360
2      3039
3       581
4       278
5       170
6       118
7        82
8        54
9        43
10       34
11       29
12       21
13       13
14       10
15        8
18        6
19        6
16        6
17        6
21        4
20        4
22        3
26        2
24        2
23        2
25        2
29        1
28        1
27        1
Name: count, dtype: int64

**Unique Paymental Sequentials** = 29

Payment Type

In [24]:
# get counts of payment types
pay_df['payment_type'].value_counts(dropna = False)

payment_type
credit_card    76795
boleto         19784
voucher         5775
debit_card      1529
not_defined        3
Name: count, dtype: int64

**Unique Payment Types** = 5

In [29]:
not_defined_df = pay_df[pay_df['payment_type'] == 'not_defined']
not_defined_df

,order_id,payment_sequential,payment_type,payment_installments,payment_value
51280,4637ca194b6387e2d538dc89b124b0ee,1,not_defined,1,0.0
57411,00b1cb0320190ca0daa2c88b35206009,1,not_defined,1,0.0
94427,c8c528189310eaa44a745b8d9d26908b,1,not_defined,1,0.0

In [43]:
payment_value_zero = pay_df[pay_df['payment_value'] == 0]
payment_value_zero

,order_id,payment_sequential,payment_type,payment_installments,payment_value
19922,8bcbe01d44d147f901cd3192671144db,4,voucher,1,0.0
36822,fa65dad1b0e818e3ccc5cb0e39231352,14,voucher,1,0.0
43744,6ccb433e00daae1283ccc956189c82ae,4,voucher,1,0.0
51280,4637ca194b6387e2d538dc89b124b0ee,1,not_defined,1,0.0
57411,00b1cb0320190ca0daa2c88b35206009,1,not_defined,1,0.0
62674,45ed6e85398a87c253db47c2d9f48216,3,voucher,1,0.0
77885,fa65dad1b0e818e3ccc5cb0e39231352,13,voucher,1,0.0
94427,c8c528189310eaa44a745b8d9d26908b,1,not_defined,1,0.0
100766,b23878b3e8eb4d25a158f57d96331b18,4,voucher,1,0.0

**Important:** All not_defined payments have a payment value of 0, indicating cause could be a promo code, reward points, or other specical circumstance resulting in a free item. 

*There are 9 entries with a payment_value of 0. They are either payment type not_defined or voucher.*

**Decision:** Data will be left in the dataset for now as an insight for client - is it an error? Is there a differnent method than a voucher in which an item could be discounted?

Payment Installments

In [36]:
pay_df['payment_installments'].value_counts(dropna = False)

payment_installments
1     52546
2     12413
3     10461
4      7098
10     5328
5      5239
8      4268
6      3920
7      1626
9       644
12      133
15       74
18       27
11       23
24       18
20       17
13       16
14       15
17        8
16        5
21        3
0         2
22        1
23        1
Name: count, dtype: int64

**Unique Payment Installments:** = 24

### CONSISTENCY CHECKS

#### 01. Mixed-Type Data

In [46]:
# check if there are any mixed-type columns
for col in pay_df.columns.tolist():
    weird = (pay_df[[col]].map(type) != pay_df[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (pay_df[weird]) > 0:
        print(col)
    else:
        print('not mixed col')

not mixed col
not mixed col
not mixed col
not mixed col
not mixed col

**No mixed columns**

#### 02. Missing Values

In [48]:
# returns number of missing data by column
pay_df.isnull().sum()

order_id                0
payment_sequential      0
payment_type            0
payment_installments    0
payment_value           0
dtype: int64

**No missing values**

#### 03. Duplicates

In [52]:
# creates a subet containing only the full duplicates
df_dups = pay_df[pay_df.duplicated()]
df_dups

Empty DataFrame
Columns: [order_id, payment_sequential, payment_type, payment_installments, payment_value]
Index: []

**No full duplicates**

### Export Data

In [54]:
pay_df.to_csv(os.path.join(path, '02 Data', 'Prepared Data','order_payments_checked.csv'))